In [68]:
# Regular imports
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
# Special imports
import tmdbsimple as tmdb
import os, json, math, time
from tqdm.notebook import tqdm_notebook

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [69]:
df_basics = pd.read_csv('Data/title_basics.csv.gz')

# Discard any unnecessary columns
df_basics.drop(columns=['originalTitle', 'isAdult', 'titleType'], inplace=True)
df_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama
3,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,Grizzly II: Revenge,2020,NaN,74,"Horror,Music,Thriller"

In [70]:
# Create database 
with open('/Users/default.DESKTOP-0LDO0LD/.secret/mySQL.json') as f:
    login = json.load(f)
    
connection_str = f"mysql+pymysql://root:{login['password']}@localhost/movies"
engine = create_engine(connection_str)
if database_exists(connection_str) == False:
    create_database(connection_str)
else: 
    print("Already there my friend")

Already there my friend

In [71]:
# Lets see what is stored in the genres columns and check what type it is.
temp = df_basics.loc[0, 'genres'].split(',')
print(type(temp))
temp

<class 'list'>

['Comedy', 'Fantasy', 'Romance']

In [72]:
# Lets create
df_basics['genres_split'] = df_basics['genres'].str.split(',')
temp = df_basics.loc[0, 'genres'].split(',')
df_basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,Grizzly II: Revenge,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [73]:
# Make a list of genres
exploded = df_basics.explode('genres_split')
exploded

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...
80721,tt9916190,Safeguard,2020,NaN,90,"Action,Adventure,Thriller",Action
80721,tt9916190,Safeguard,2020,NaN,90,"Action,Adventure,Thriller",Adventure
80721,tt9916190,Safeguard,2020,NaN,90,"Action,Adventure,Thriller",Thriller
80722,tt9916362,Coven,2020,NaN,92,"Drama,History",Drama
80722,tt9916362,Coven,2020,NaN,92,"Drama,History",History

In [74]:
df_title_genre = exploded[['tconst', 'genres_split']]
df_title_genre

          tconst genres_split
0      tt0035423       Comedy
0      tt0035423      Fantasy
0      tt0035423      Romance
1      tt0062336        Drama
2      tt0069049        Drama
...          ...          ...
80721  tt9916190       Action
80721  tt9916190    Adventure
80721  tt9916190     Thriller
80722  tt9916362        Drama
80722  tt9916362      History

[150642 rows x 2 columns]

In [88]:
genres_to_make = sorted(exploded['genres_split'].dropna().unique())
genres_to_make

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [89]:
## Making the genre mapper dictionary
genre_ints = range(len(genres_to_make))
genre_map = dict(zip(genres_to_make, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [77]:
# make genre map a data frame
genre_lookup = pd.DataFrame({'Genre_Name': genre_map.keys(), 'Genre_Id': genre_map.values()})
genre_lookup # !!!

    Genre_Name  Genre_Id
0       Comedy         0
1      Fantasy         1
2      Romance         2
3        Drama         3
4       Horror         4
5       Sci-Fi         5
6        Music         6
7     Thriller         7
8      Mystery         8
9      Musical         9
10      Action        10
11   Adventure        11
12       Crime        12
13   Animation        13
14      Family        14
15     History        15
16         War        16
17   Biography        17
18       Sport        18
19     Western        19
20       Adult        20
21       Short        21
22  Reality-TV        22
23        News        23
24   Talk-Show        24
25   Game-Show        25

In [78]:
## make new integer genre_id and drop string genres
df_title_genre['genre_id'] = df_title_genre['genres_split'].map(genre_map)
df_title_genre = df_title_genre.drop(columns='genres_split')
df_title_genre #!!!  no primary key

C:\Users\default.DESKTOP-0LDO0LD\AppData\Local\Temp\ipykernel_11876\371154401.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_title_genre['genre_id'] = df_title_genre['genres_split'].map(genre_map)

          tconst  genre_id
0      tt0035423         0
0      tt0035423         1
0      tt0035423         2
1      tt0062336         3
2      tt0069049         3
...          ...       ...
80721  tt9916190        10
80721  tt9916190        11
80721  tt9916190         7
80722  tt9916362         3
80722  tt9916362        15

[150642 rows x 2 columns]

In [79]:
# Delete the genres and genres_split columns
df_basics.drop(columns=['genres','genres_split'], inplace=True)

In [80]:
# get max string length
max_str_len_tconst = df_basics['tconst'].fillna('').map(len).max()
max_str_len_title = df_basics['primaryTitle'].fillna('').map(len).max()

from sqlalchemy.types import *
## Calculate max string lengths for object columns
# already in line 2 and 3
# key_len = basics['tconst'].fillna('').map(len).max()
# title_len = basics['primaryTitle'].fillna('').map(len).max()

## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(max_str_len_tconst+1), 
    "primaryTitle": Text(max_str_len_title+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [81]:
# Save to sql with dtype and index=False
df_basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False)

80723

In [82]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);');

In [83]:
pd.read_sql("Select * from title_basics", engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0088751,The Naked Monster,2005.0,None,100
4,tt0093119,Grizzly II: Revenge,2020.0,None,74
...,...,...,...,...,...
80718,tt9914942,Life Without Sara Amat,2019.0,None,74
80719,tt9915872,The Last White Witch,2019.0,None,97
80720,tt9916170,The Rehearsal,2019.0,None,51
80721,tt9916190,Safeguard,2020.0,None,90
80722,tt9916362,Coven,2020.0,None,92

In [99]:
# Load the results from previous step
df_combined = pd.read_csv('Data/tmdb_results_combined.csv.gz')

In [100]:
# drop duplicates 
df_combined.drop_duplicates(inplace=True)
print("The number of duplicates : ", df_combined.duplicated().sum())

The number of duplicates :  0

In [105]:
#  remove rows that are imdb_id  = 0
df_combined = df_combined[df_combined['imdb_id'] != '0']

In [107]:
# add new table, primary key !!!
df_combined.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2009.0,PG
5,tt0118852,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}]",NaN,49511.0,en,Chinese Coffee,...,0.0,99.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,There's a fine line between friendship and bet...,Chinese Coffee,0.0,6.900,47.0,R

By this time you should have the following tables in the database:
 - title_basics
 - title_ratings
 - title_genres 
         genre_lookup # new table add table!!! -> genres
 - genres 
 - tmdb_data
 
 
 
Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

After creating each table, show the first 5 rows of that table using a SQL query.

Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

In [85]:
pd.read_sql("SHOW TABLES", engine)

  Tables_in_movies
0     title_basics